---
kind: other
id: Methods.T:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes
source: html/b889bb4e-01d9-ad55-6976-3173a6c28f7d.htm
---
# PartMakerMethodToDivideVolumes Methods

Adds intersecting reference with an offset.